
void setup()             
{
  for(int i=2 ; i<=7 ; i++)
  {
    pinMode(i, OUTPUT);    //กำหนดให้ขาพอร์ตที่ 2 ถึง 7 เป็น OUTPUT
  }
}
void loop()
{
   for(int i=2 ; i<=7 ; i++)
   {
      digitalWrite(i,HIGH);  //สั่งให้ขาพอร์ตที่ i มีสถานะเป็น HIGH
      tone(9,131+(20*i-2),1000); //สั่งงานเสียงผ่าน pin หมายเลข 9 โดยให้เสียงดัง 1000 มิลลิวินาที
      delay(1000);           //หน่วงเวลา 1000 มิลลิวินาที หรือ 1 วินาที
      digitalWrite(i,LOW);   //สั่งให้ขาพอร์ตที่ i มีสถานะเป็น LOW
      delay(1000);           //หน่วงเวลา 1000 มิลลิวินาที หรือ 1 วินาที
   }
}
